УТ_для_edt/src/InformationRegisters/смартСтатусыИнженеров/смартСтатусыИнженеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартСтатусыИнженеров</name>
  <comment>//смарт:ММ 633 10.09.2021</comment>
  <resources>
    <name>ТекущийСтатус</name>
    <type>
      <types>CatalogRef.смартСписокСтатусовИнженеров</types>
    </type>
  </resources>
  <dimensions>
    <name>Инженер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ДолжностнаяПозиция</name>
    <type>
      <types>CatalogRef.CRM_ДолжностныеПозиции</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтписалсяОтEmailРассылок</name>
    <comment>Отписался от Email рассылок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Планируемый</name>
    <comment>Участвует в планировании проектов</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_УчаствуетВАнкетировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Фотография</name>
    <comment>Фотография клиента частное лицо</comment>
    <type>
      <types>CatalogRef.ПользователиПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЕмейлДляСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РазрешеноИзменятьКоординаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартМенеджерСайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартРабочаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартРабочийТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартВнутреннийНомерВАТС</name>
    <comment>#1352 смарт: Лопато 04.05.2023 //Звонки из 1С (через городской стационарный телефон)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартДоступныДанныеВнутреннихФизическихЛиц</name>
    <comment>#1644 смарт: Ермаков 19.04.2024 / Изменить доступ к документам физических лиц</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартДоступныДанныеВнешнихФизическихЛиц</name>
    <comment>#1644 смарт: Ермаков 19.04.2024 / Изменить доступ к документам физических лиц</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартВнутреннийНомерВАТСДополнительный</name>
    <comment>//++ #Б-6744 смарт: Фролов 28.05.2026 //Перехват заявок. Загрузка звонков в 1С с нескольких мобильных менеджеров</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>сфпВремяЗадержкиНабораДобавочногоНомера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ДополнительнаяИнформация</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартОповещениеОбИнтересах</name>
    <comment>//++ #Б-3560 смарт: Фролов 01.07.2025 //Создания механизма настройки оповещений о событиях с Интересами. </comment>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Новые</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Завершенные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Запчасти</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РасходныеМатериалы</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Прочее</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектОповещения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартКонтролируемыеМенеджеры</name>
    <comment>//++ #Б-7838 смарт: Фролов 12.08.2026 //Уведомления для Беловой Т.</comment>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/InformationRegisters/смартСтатусыИнженеров/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура ИнженерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", "Пользователи");
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	Пользователи = ПолучитьИнженеровИзНастройки();
	ПараметрыФормы.Вставить("смартОтображаемыеПользователи", Пользователи);
	
	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаСписка", ПараметрыФормы, Элемент,,,, , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьИнженера(Команда)
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Действие", "Добавить");
	Оповещение = Новый ОписаниеОповещения("ОкончаниеДобавленияУдаленияПользователя", ЭтотОбъект, ДопПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", "Пользователи");
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	СкрываемыеПользователи = ПолучитьИнженеровИзНастройки();
	ПараметрыФормы.Вставить("СкрываемыеПользователи", СкрываемыеПользователи);
	
	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаСписка", ПараметрыФормы, ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура УдалитьИнженера(Команда)
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Действие", "Удалить");
	Оповещение = Новый ОписаниеОповещения("ОкончаниеДобавленияУдаленияПользователя", ЭтотОбъект, ДопПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", "Пользователи");
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	смартОтображаемыеПользователи = ПолучитьИнженеровИзНастройки();
	ПараметрыФормы.Вставить("смартОтображаемыеПользователи", смартОтображаемыеПользователи);

	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаСписка", ПараметрыФормы, ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИнженеровИзНастройки()
	
	РезультатСписокЗначений = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	смартПредопределенныеЗначенияЗначения.Значение КАК Значение
	|ИЗ
	|	Справочник.смартПредопределенныеЗначения.Значения КАК смартПредопределенныеЗначенияЗначения
	|ГДЕ
	|	смартПредопределенныеЗначенияЗначения.Ссылка = &ПредопределенныйЭлемент";
	
	ПредопределенныйЭлемент = Справочники.смартПредопределенныеЗначения.СписокИнженеров;
	
	Запрос.УстановитьПараметр("ПредопределенныйЭлемент", ПредопределенныйЭлемент);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат РезультатСписокЗначений;
	КонецЕсли;
	
	РезультатСписокЗначений.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Значение"));
	
	Возврат РезультатСписокЗначений;
	
КонецФункции

&НаКлиенте
Процедура ОкончаниеДобавленияУдаленияПользователя(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("СправочникСсылка.Пользователи") Тогда		
		МассивПользователей = Новый Массив;
		МассивПользователей.Добавить(РезультатЗакрытия);
	ИначеЕсли ТипЗнч(РезультатЗакрытия) = Тип("Массив") Тогда
		МассивПользователей = РезультатЗакрытия;
	Иначе
		Возврат;
	КонецЕсли;	
	
	Если ДополнительныеПараметры.Действие = "Добавить" Тогда
		ДобавитьИнженераНаСервере(МассивПользователей);
	Иначе
		УдалитьИнженераНаСервере(МассивПользователей);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ДобавитьИнженераНаСервере(МассивПользователей)
	
	Если НЕ ЗначениеЗаполнено(МассивПользователей) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	смартПредопределенныеЗначенияЗначения.Значение КАК Значение
	|ИЗ
	|	Справочник.смартПредопределенныеЗначения.Значения КАК смартПредопределенныеЗначенияЗначения
	|ГДЕ
	|	смартПредопределенныеЗначенияЗначения.Ссылка = &ПредопределенныйЭлемент
	|	И смартПредопределенныеЗначенияЗначения.Значение В (&МассивПользователей)";
	
	ПредопределенныйЭлемент = Справочники.смартПредопределенныеЗначения.СписокИнженеров;
	
	Запрос.УстановитьПараметр("МассивПользователей", МассивПользователей);
	Запрос.УстановитьПараметр("ПредопределенныйЭлемент", ПредопределенныйЭлемент);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		УстановитьПривилегированныйРежим(Ложь);
		Возврат;
	КонецЕсли;
	
	Об = ПредопределенныйЭлемент.ПолучитьОбъект();
	
	Для Каждого ТекПользователь Из МассивПользователей Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("Значение", ТекПользователь);
		НайденныеСтроки = Об.Значения.НайтиСтроки(Отбор);
		
		Если НайденныеСтроки.Количество() <> 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Об.Значения.Добавить();
		НоваяСтрока.Значение = ТекПользователь;
	КонецЦикла;

	Об.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьИнженераНаСервере(МассивПользователей)
	
	Если НЕ ЗначениеЗаполнено(МассивПользователей) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	смартПредопределенныеЗначенияЗначения.Значение КАК Значение
	|ИЗ
	|	Справочник.смартПредопределенныеЗначения.Значения КАК смартПредопределенныеЗначенияЗначения
	|ГДЕ
	|	смартПредопределенныеЗначенияЗначения.Ссылка = &ПредопределенныйЭлемент
	|	И смартПредопределенныеЗначенияЗначения.Значение В (&МассивПользователей)";
	
	ПредопределенныйЭлемент = Справочники.смартПредопределенныеЗначения.СписокИнженеров;
	
	Запрос.УстановитьПараметр("МассивПользователей", МассивПользователей);
	Запрос.УстановитьПараметр("ПредопределенныйЭлемент", ПредопределенныйЭлемент);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		УстановитьПривилегированныйРежим(Ложь);
		Возврат;
	КонецЕсли;
	
	Об = ПредопределенныйЭлемент.ПолучитьОбъект();
	
	Сч = Об.Значения.Количество() - 1;
	
	Пока Сч >= 0 Цикл
		
		ТекСтрока = Об.Значения[Сч];
		Если МассивПользователей.Найти(ТекСтрока.Значение) <> Неопределено Тогда
			Об.Значения.Удалить(Сч);
		КонецЕсли;
		
		Сч = Сч - 1;

	КонецЦикла;
	
	Об.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
